package demo.spring.boot.film;

import java.util.ArrayList;
import java.util.List;

public class IP {
    //         广东省广州市（中国电信）               list.add("          202.96.128.86
//         广东省广州市（中国铁通)               list.add("            61.235.70.98
//         广东省汕尾市（中国电信）               list.add("           202.96.128.166
//         广东省汕头市（中国电信）               list.add("           202.96.128.166
//         广东省河源市（中国电信）               list.add("           202.96.128.166
//         广东省河源市（中国网通）               list.add("           210.21.196.5
//         广东省深圳市（中国电信）               list.add("           202.96.128.166
//         广东省阳江市（中国电信）               list.add("           202.96.128.86
//         广东省增城市（中国电信）               list.add("           202.96.128.86
//         广东省广州市（中国铁通）               list.add("           61.235.70.98
//         广东省江门市（中国电信）               list.add("           202.96.128.86
//         广东省佛山市（中国网通）               list.add("           221.5.88.88
//         广东省佛山市（中国电信）               list.add("           202.96.128.86
//         广东省佛山市（中国联通）               list.add("           221.4.8.1
//         广东省梅州市（中国电信）               list.add("           61.235.70.98
//         广东省湛江市（中国电信）               list.add("           202.96.128.68
//         广东省东莞市（中国电信）               list.add("           202.96.128.86
//         广西
//         广西南宁市（中国电信）                list.add("            202.103.224.68
//         广西省南宁市（中国铁通）               list.add("           61.235.164.18
//         广西壮族自治区（中国电信）              list.add("          202.103.224.68
//         广西壮族自治区柳州市 (中国网通）          list.add("         221.7.136.68
//         广西壮族自治区防城港市（中国铁通）          list.add("        61.235.164.13
//         广西壮族自治区柳州市 (中国电信）          list.add("         202.103.224.68
//         湖南
//         湖南省衡阳市（中国电信）               list.add("           220.170.64.96
//         湖南省衡阳市（中国电信）               list.add("           59.51.78.210
//         湖南省岳阳市（中国铁通）               list.add("           211.98.2.4
//         湖南长沙（中国电信）                 list.add("            202.103.96.112
//         湖南省永州市（中信宽带）               list.add("           219.72.225.254
//         湖南永州市(中国电信)                list.add("             218.76.248.6
//         湖南省湘潭市（中国电信）               list.add("           222.246.129.81
//         湖南省湘潭市（中国电信）               list.add("           220.170.0.210
//         湖南省常德市（中国电信）               list.add("           59.51.78.210
//         湖南省益阳市（中国铁通）               list.add("           61.232.206.100
//         湖南省吉首市（中国电信）               list.add("           222.246.129.81
//         湖南邵阳市（中国电信）                list.add("            218.76.192.101
//         湖南省邵阳市（中国DIAN电信）           list.add("           59.51.78.210
//         湖南省岳阳市（中国电信）               list.add("           222.246.129.81
//         福建
//         福建省厦门市（中国电信）               list.add("          202.101.103.55
//         福建省厦门市（中国网通）               list.add("          218.104.128.106
//         福建省泉州市（中国电信）               list.add("          202.101.107.85
//         福建省漳州市（中国电信）               list.add("          218.85.157.99
//         福建省福州市（中国电信）               list.add("          218.85.157.99
//         福建省泉州市（中国电信）               list.add("          218.85.157.99
//         福建省龙岩市（中国电信）               list.add("          202.101.113.55
//         江西
//         江西省新余市（中国电信）               list.add("          202.101.224.69
//         江西省南昌市（中国电信）               list.add("          202.101.224.69
//         江西省南昌市（中国铁通）               list.add("          211.98.2.4
//         江西省宜春市（中国电信）               list.add("          202.101.224.69
//         山西
//         山西省运城市（中国网通）               list.add("          202.99.192.66
//         山西省太原市（中国网通）               list.add("          202.99.192.66
//         山西省太原市（中国电信）               list.add("          219.150.32.132
//         山西省太原市（中国铁通）               list.add("          211.98.32.132
//         山西省大同市 中国网通                list.add("           202.99.192.66
//         江苏
//         江苏省靖江市（中国电信）               list.add("         221.228.255.1
//         江苏省南京市（中国电信）               list.add("         218.2.135.1
//         江苏省镇江市（中国电信）               list.add("         218.2.135.1
//         江苏省盐城市（中国铁通）               list.add("         222.45.1.40
//         江苏省淮安市(中国电信)               list.add("           61.147.37.1
//         江苏省苏州市（中国电信）               list.add("         61.177.7.1
//         江苏省扬州市（中国电信）               list.add("         61.147.37
//         江苏省无锡市（中国铁通）               list.add("         211.98.2.4
//         江苏省无锡市（中国电信）               list.add("         221.228.255.1
//         浙江
//         浙江省宁波市（中国电信）               list.add("         202.96.104.15
//         浙江省宁波市（中国电信）               list.add("         202.96.104.16
//         浙江省宁波市（中国电信）               list.add("         202.96.104.27
//         浙江省杭州市（中国网通）               list.add("         218.108.248.200
//         浙江省溫州市（中国电信）               list.add("         61.153.177.199
//         浙江省杭州市（中国电信）               list.add("         202.101.172.35
//         浙江省乐清市（中国电信）               list.add("         61.153.177.200
//         浙江省余姚市（中国电信）               list.add("         202.96.104.17
//         陕西
//         陕西省榆林市（中国电信）               list.add("         202.100.4.15
//         陕西省延安市（中国电信）               list.add("         61.134.1.4
//         陕西西安（中国铁通）                 list.add("           222.41.52.3
//         陕西省西安市（中国电信）               list.add("         218.30.19.40
//         安徽省
//                                    list.add("             202.102.192.6
//         安徽省阜阳市（中国电信）               list.add("    202.102.192.68
//         湖北湖北省（中国电信）                list.add("     202.103.44.150
//         湖北省武汉市（中国电信）               list.add("    202.103.24.68
//         湖北省武汉市(中国电信)               list.add("      202.104.24.68
//         湖北黄石市（中国电信）                list.add("     202.103.44.150
//         山东
//         山东省烟台市(中国网通)               list.add("      202.102.154.3
//         山东省济宁市（中国网通）               list.add("     202.102.154.3
//         山东省青岛市（中国网通）               list.add("     202.102.134.68
//         山东省滨州市（中国网通）               list.add("     202.102.134.68
//         山东省临沂市（中国网通)               list.add("      202.102.154.3
//         山东省临沂市（中国电信）               list.add("     219.146.0.130
//         山东省德州市（中国网通）               list.add("     202.102.152.3
//         山东滕州市（中国网通）                list.add("     202.102.128.68
//         山东省菏泽市(中国网通)               list.add("      202.102.152.3
//         山东省枣庄市(中国电信)               list.add("      219.146.0.130
//         山东省淄博市（中国网通）               list.add("     202.102.154.3
//         山东省聊城市（中国网通）               list.add("    202.102.152.3
//         山东省东营市（中国网通）               list.add("    202.102.152.3
//         山东省东营市（中国网通）               list.add("    202.102.154.3
//         山东省威海市（中国网通）               list.add("    202.102.154.3
//         黑龙江
//         黑龙江省全省共用（中国网通）             list.add("   202.97.224.69
//         黑龙江哈尔滨（中国电信）               list.add("    219.150.32.132
//         河北
//         河北省石家庄（中国网通）               list.add("     202.99.160.68
//         河北省邯郸市（网通）                 list.add("       202.99.160.68
//         河北省邯郸市（中国铁通）               list.add("     211.98.2.4
//         河北省邢台市（中国网通）               list.add("     202.99.160.68
//         河北省秦皇岛(中国网通)               list.add("      202.99.166.4
//         河北省沧州市（中国网通）               list.add("     202.99.160.68
//         河北省张家口市（中国网通）              list.add("     202.99.166.4
//         河北省张家口市（中国电信）              list.add("     219.150.32.132
//         河北省邢台市（中国网通）               list.add("     202.99.160.68
//         贵州
//         贵州省贵阳市（中国电信）               list.add("      202.98.192.67
//         云南云南省玉溪市（中国电信）             list.add("     222.172.200.68
//         云南省（中国铁通）                  list.add("        211.98.72.7
//         云南省昆明市（中国网通）               list.add("      221.3.131.12
//         辽宁
//         辽宁省朝阳市（中国铁通）               list.add("     61.232.206.102
//         辽宁省朝阳市（中国电信）               list.add("     219.150.32.132
//         辽宁省朝阳市（中国网通）               list.add("     202.96.69.38
//         辽宁省大连市（中国电信）               list.add("     219.150.32.132.
//         辽宁省大连市（中国网通）               list.add("     202.96.69.38
//         辽宁省抚顺市（中国电信）               list.add("     219.150.32.132
//         河南
//         河南省 （中国电信）                 list.add("      222.88.88.88
//         河南省（平煤集团电信网）               list.add("    210.76.0.2
//         河南省郑州市（中国电信）               list.add("    219.150.150.150
//         河南省郑州市（中国网通）               list.add("    202.102.224.68
//         河南省漯河市（中国电信）               list.add("    219.150.32.132
//         河南省安阳市（中国铁通）               list.add("    211.98.192.3
//         河南省洛阳市（中国电信）               list.add("    222.88.88.88
//         河南省网通DNS(全省)               list.add("        202.102.224.68
//         河南省驻马店市（中国网通）              list.add("   202.102.224.68
//         四川
//         四川省重庆市（中国电信）               list.add("     61.128.128.68
//         四川省泸州市（中国电信）               list.add("     61.139.2.69
//         四川省泸州市（中国铁通）               list.add("     61.236.159.99
//         四川省成都市（中国电信）               list.add("     202.98.96.68
//         四川省遂宁市（中国电信）               list.add("     202.98.96.68
//         内蒙古
//         内蒙古呼和浩特市（中国电信）             list.add("    219.148.162.31
//         内蒙古呼和浩特市（中国网通）             list.add("    202.224.99.68
//         天津天津市（中国电信）                list.add("      219.150.32.132
//         天津市（中国网通）                  list.add("       202.99.104.68
//         新疆
//         新疆喀什市（中国电信）                list.add("     61.128.114.166
//         新疆阿克苏市（中国电信）               list.add("    61.128.114.166
//         新疆库尔勒市（中国电信）               list.add("    61.128.114.166
//         吉林吉林省全省共用（中国网通）            list.add("  202.98.5.68
//         海南海南省海口市（中国铁通）             list.add("   202.103.96.112
//         海南省海口市 (中国电信)              list.add("      202.100.197.50
//         西藏
//         西藏拉萨（中国网通）                 list.add("      221.13.65.34
//         甘肃
//         甘肃省兰州市中国电信                 list.add("      202.100.64.68
//         甘肃省兰州市中国铁通                 list.add("      211.98.121.27
//         甘肃省武威市（中国电信）               list.add("     202.100.64.68


//    List<String> list = new ArrayList<>();
//list.add("202.96.128.86");
//list.add("61.235.70.98");
//list.add("202.96.128.166");
//list.add("202.96.128.166");
//list.add("202.96.128.166");
//list.add("210.21.196.5");
//list.add("202.96.128.166");
//list.add("202.96.128.86");
//list.add("202.96.128.86");
//list.add("61.235.70.98");
//list.add("202.96.128.86");
//list.add("221.5.88.88");
//list.add("202.96.128.86");
//list.add("221.4.8.1");
//list.add("61.235.70.98");
//list.add("202.96.128.68");
//list.add("202.96.128.86");
//list.add("202.103.224.68");
//list.add("61.235.164.18");
//list.add("202.103.224.68");
//list.add("221.7.136.68");
//list.add("61.235.164.13");
//list.add("202.103.224.68");
//list.add("220.170.64.96");
//list.add("59.51.78.210");
//list.add("211.98.2.4");
//list.add("202.103.96.112");
//list.add("219.72.225.254");
//list.add("218.76.248.6");
//list.add("222.246.129.81");
//list.add("220.170.0.210");
//list.add("59.51.78.210");
//list.add("61.232.206.100");
//list.add("222.246.129.81");
//list.add("218.76.192.101");
//list.add("59.51.78.210");
//list.add("222.246.129.81");
//list.add("202.101.103.55");
//list.add("218.104.128.106");
//list.add("202.101.107.85");
//list.add("218.85.157.99");
//list.add("218.85.157.99");
//list.add("218.85.157.99");
//list.add("202.101.113.55");
//list.add("202.101.224.69");
//list.add("202.101.224.69");
//list.add("211.98.2.4");
//list.add("202.101.224.69");
//list.add("202.99.192.66");
//list.add("202.99.192.66");
//list.add("219.150.32.132");
//list.add("211.98.32.132");
//list.add("202.99.192.66");
//list.add("221.228.255.1");
//list.add("218.2.135.1");
//list.add("218.2.135.1");
//list.add("222.45.1.40");
//list.add("61.147.37.1");
//list.add("61.177.7.1");
//list.add("61.147.37");
//list.add("211.98.2.4");
//list.add("221.228.255.1");
//list.add("202.96.104.15");
//list.add("202.96.104.16");
//list.add("202.96.104.27");
//list.add("218.108.248.200");
//list.add("61.153.177.199");
//list.add("202.101.172.35");
//list.add("61.153.177.200");
//list.add("202.96.104.17");
//list.add("202.100.4.15");
//list.add("61.134.1.4");
//list.add("222.41.52.3");
//list.add("218.30.19.40");
//list.add("202.102.192.6");
//list.add("202.102.192.68");
//list.add("202.103.44.150");
//list.add("202.103.24.68");
//list.add("202.104.24.68");
//list.add("202.103.44.150");
//list.add("202.102.154.3");
//list.add("202.102.154.3");
//list.add("202.102.134.68");
//list.add("202.102.134.68");
//list.add("202.102.154.3");
//list.add("219.146.0.130");
//list.add("202.102.152.3");
//list.add("202.102.128.68");
//list.add("202.102.152.3");
//list.add("219.146.0.130");
//list.add("202.102.154.3");
//list.add("202.102.152.3");
//list.add("202.102.152.3");
//list.add("202.102.154.3");
//list.add("202.102.154.3");
//list.add("202.97.224.69");
//list.add("219.150.32.132");
//list.add("202.99.160.68");
//list.add("202.99.160.68");
//list.add("211.98.2.4");
//list.add("202.99.160.68");
//list.add("202.99.166.4");
//list.add("202.99.160.68");
//list.add("202.99.166.4");
//list.add("219.150.32.132");
//list.add("202.99.160.68");
//list.add("202.98.192.67");
//list.add("222.172.200.68");
//list.add("211.98.72.7");
//list.add("221.3.131.12");
//list.add("61.232.206.102");
//list.add("219.150.32.132");
//list.add("202.96.69.38");
//list.add("219.150.32.132.");
//list.add("202.96.69.38");
//list.add("219.150.32.132");
//list.add("222.88.88.88");
//list.add("210.76.0.2");
//list.add("219.150.150.150");
//list.add("202.102.224.68");
//list.add("219.150.32.132");
//list.add("211.98.192.3");
//list.add("222.88.88.88");
//list.add("202.102.224.68");
//list.add("202.102.224.68");
//list.add("61.128.128.68");
//list.add("61.139.2.69");
//list.add("61.236.159.99");
//list.add("202.98.96.68");
//list.add("202.98.96.68");
//list.add("219.148.162.31");
//list.add("202.224.99.68");
//list.add("219.150.32.132");
//list.add("202.99.104.68");
//list.add("61.128.114.166");
//list.add("61.128.114.166");
//list.add("61.128.114.166");
//list.add("202.98.5.68");
//list.add("202.103.96.112");
//list.add("202.100.197.50");
//list.add("221.13.65.34");
//list.add("202.100.64.68");
//list.add("211.98.121.27");
//list.add("202.100.64.68");

}
